#include <iostream>
#include <iomanip>
#include <windows.h>
using namespace std;

int main()
{
    SetConsoleOutputCP(CP_UTF8);

    cout << "Толькi ў сэрцы трывожным пачую\n"
         << "За краiну радзiмую жах,\n"
         << "Успомню Вострую Браму святую\n"
         << "I ваякаў на грозных канях.\n\n"

         << "У белай пене праносяцца конi,\n"
         << "Рвуцца, мкнуцца i цяжка хрыпяць,\n"
         << "Старадаўняй Лiтоўскай Пагонi\n"
         << "Не разбiць, не спынiць, не стрымаць!\n\n"

         << "У бязмерную даль вы ляцiце,\n"
         << "А за вамi, прад вамi — гады.\n"
         << "Вы за кiм у пагоню спяшыце?\n"
         << "Дзе шляхi вашы йдуць i куды?\n\n"

         << "Мо яны, Беларусь, паняслiся\n"
         << "За тваiмi дзяцьмi наўздагон,\n"
         << "Што забылi цябе, адраклiся,\n"
         << "Прадалi i аддалi ў палон?\n\n"

         << "Бiце ў сэрцы iх — бiце мячамi,\n"
         << "Не давайце чужынцамi быць!\n"
         << "Хай пачуюць, як сэрца начамi\n"
         << "Аб радзiмай старонцы балiць.\n\n"

         << "Мацi родная, Мацi-Краiна!\n"
         << "Не ўсцiшыцца гэтакi боль.\n"
         << "Ты прабач, ты прымi свайго сына,\n"
         << "За Цябе яму ўмерцi дазволь!\n\n"

         << "Ўсё лятуць i лятуць тыя конi,\n"
         << "Срэбнай збруяй далёка грымяць…\n"
         << "Старадаўняй Лiтоўскай Пагонi\n"
         << "Не разбiць, не спынiць, не стрымаць.\n\n"
         << "            ПАГОНЯ\n";

    return 0;
}